Repository: HilltopWorks/BokuNoNatsuyasumi2
Catalog: GFX/technique.msg.po
Languages: img

source: 両者、引き分け {STOP}
img: Draw {STOP}

source: 押し出し {STOP}
img: Oshidashi Frontal Push Out{STOP}

source: スタミナ勝ち {STOP}
img: Stamina {STOP}

source: 自爆 {STOP}
img: Self-destruct {STOP}

source: 巴投げ {STOP}
img: Tomoenage Circular Throw{STOP}

source: 首投げ {STOP}
img: Kubinage Neck Throw{STOP}

source: 張り手 {STOP}
img: Harite Palm Slap{STOP}

source: しっぺ {STOP}
img: Wrist Slap {STOP}

source: 足引き {STOP}
img: Leg pull {STOP}

source: つっぱり {STOP}
img: Tsuppari Thrusting Strike{STOP}

source: つり出し {STOP}
img: Tsuridashi Frontal Lift Out{STOP}

source: 大張り手 {STOP}
img: Dai Harite Giga Palm Slap{STOP}

source: 突き出し {STOP}
img: Tsukidashi Frontal Thrust Out{STOP}

source: カサ回し {STOP}
img: Kasa Mawashi Spin Toss{STOP}

source: タイマン {STOP}
img: Mano-a-mano {STOP}

source: サバ折り {STOP}
img: Saba-ori Forward Force Down{STOP}

source: 上手投げ {STOP}
img: Uwatenage Over Arm Throw{STOP}

source: 叩きつけ {STOP}
img: Powerslam {STOP}

source: うっちゃり {STOP}
img: Utchari Backward Pivot Throw{STOP}

source: がぶりより {STOP}
img: Gaburi Yori Torso Push{STOP}

source: 一本背負い {STOP}
img: Ipponzeoi One-Armed Shoulder Throw{STOP}

source: 弾き飛ばし {STOP}
img: Knock down {STOP}

source: やりすごし {STOP}
img: Overreach {STOP}

source: すそはらい {STOP}
img: Suso-Harai Rear Foot Sweep{STOP}

source: すくい投げ {STOP}
img: Sukui Nage Scooping Throw{STOP}

source: ぶちかまし {STOP}
img: Buchikamashi Face Strike{STOP}

source: あびせ倒し {STOP}
img: Abisetaoshi Backward Force-Down{STOP}

source: 引き落とし {STOP}
img: Hikiotoshi Hand Pull Down{STOP}

source: ツノ刈り投げ {STOP}
img: Horn Chopper {STOP}

source: 大ぶちかまし {STOP}
img: Dai Buchikamashi Great Face Strike{STOP}

source: 大うっちゃり {STOP}
img: Dai Utchari Great Backward Pivot Throw{STOP}

source: どぶちかまし {STOP}
img: Illegal Strike {STOP}

source: ひっくり返し {STOP}
img: Overturn {STOP}

source: プリマドンナ {STOP}
img: Prima Donna {STOP}

source: 自分ボンバ一 {STOP}
img: Living Bomb {STOP}

source: うっちゃり投げ {STOP}
img: Utchari Backward Pivot Throw{STOP}

source: ブレンバスタ一 {STOP}
img: Brain Buster {STOP}

source: カマきりバスタ一 {STOP}
img: Mantis Buster {STOP}

source: グレ一トつっぱり {STOP}
img: Great Tsuppari Great Thrusting Strike{STOP}

source: フジミヤマドロップ {STOP}
img: Fuji Drop {STOP}
